<?php return [
    'plugin' => [
        'name' => 'سرویس پیامک',
        'description' => 'سیستم  سرویس پیامک',
        'tab' => 'سرویس پیامک',
        'access_sms' => 'مدیریت سرویس پیامک',
    ],
    'components' => [
        'verify' => [
            'title' => 'تاببد شماره موبایل',
            'desc' => 'جهت استفاده از امکانات سایت باید شماره موبایل خود را تایید کنید.',
            'desc_code' => 'جهت تایید شماره موبایل خود کد ارسالی را وارد کنید.',
            'complete' => 'تایید شماره موبایل کامل شد ، اکنون می توانید از سیستم استفاده کنید.',
            'btn' => [
                'send' => 'تایید و ارسال پیامک',
                'check' => 'بررسی کد و تایید شماره موبایل',
            ],
        ],
    ],
    'sms' => [
        'title' => 'سرویس پیامک',
        'description' => 'تظیمات سرویس پیامک',
        'setting' => 'بیت کُدر',
        'mobile' => 'شماره موبایل:',
        'mobile_comment' => 'برای مثال: 09123456789',
        'code' => 'کد پیامک شده:',
        'code_comment' => 'کد تایید را وارد کنید',
    ],
    'kavenegar' => [
        'title' => 'کاوه نگار',
        'token' => 'کلید دسترسی (Api Key)',
        'from_number' => 'شماره ارسال(اختیاری)',
        'footer' => 'متن پاورقی پیامک',
    ],
];