<?php return [
    'plugin' => [
        'name' => 'تنظیمات سرویس پیامک',
        'description' => 'تنظیمات سرویس پیامک',
        'tab' => 'سرویس پیامک',
        'access_sms' => 'مدیریت سرویس پیامک',
    ],
    'components' => [
        'verify' => [
            'title' => 'تاببد شماره موبایل',
            'desc' => 'جهت استفاده از امکانات سایت باید شماره موبایل خود را تایید کنید.',
            'desc_code' => 'جهت تایید شماره موبایل خود کد ارسالی را وارد کنید.',
            'complete' => 'تایید شماره موبایل کامل شد ، اکنون می توانید از سیستم استفاده کنید.',
            'btn' => [
                'send' => 'تایید و ارسال پیامک',
                'check' => 'بررسی کد و تایید شماره موبایل',
            ],
        ],
        'auth' => [
            'title' => 'ورود / عضویت',
            'desc' => 'سیستم اعتبارسنجی کاربران',
            'send' => 'ورود / عضویت',
            'check' => 'لطفا کد ارسال شده به موبایل یا ایمیل خود در اینجا وارد کنید.',
            'complete' => 'شما با موفقیت وارد سیستم شدید.',
            'btn' => [
                'send' => 'ارسال کد',
                'again' => 'ارسال مجدد کد',
                'check' => 'اعتبارسنجی',
            ],
            'fields' => [
                'receiver' => 'موبایل / ایمیل را وارد کنید',
                'code' => 'کد اعتبارسنجی را وارد کنید.'
            ]
        ],
    ],
    'sms' => [
        'title' => 'سرویس پیامک',
        'description' => 'تنظیمات سرویس پیامک',
        'mobile' => 'شماره موبایل:',
        'mobile_comment' => 'برای مثال: 09123456789',
        'code' => 'کد پیامک شده:',
        'code_comment' => 'کد تایید را وارد کنید',
        'status' => [
            'active' => 'فعال',
            'inactive' => 'غیر فعال',
        ]
    ],
    'options' => [
        'welcome' => 'خوش آمد گویی',
        'verify' => 'اعتبار سنجی موبایل',
        'order' => [
            'paid' => 'وضعیت سفارش(پرداخت شده)',
            'sent' => 'وضعیت سفارش(ارسال شده)',
        ],
    ],
    'gateway' => [
        'title' => 'درگاه پیامک',
        'description' => 'تنظیمات درگاه ارسال پیامک',
        'select' => 'انتخاب درگاه پیامک',
        'items' => [
            'global' => [
                'token' => 'کلید دسترسی (Api Key)',
                'from_number' => 'شماره ارسال',
                'from_number_pattern' => 'شماره ارسال برای پترن',
                'footer' => 'متن پاورقی پیامک',
            ],
            'cuphost' => [
                'title' => 'کاپ هاست',
                'patterns' => [
                    'welcome' => 'کد پترن خوش آمد گویی',
                    'verify' => 'کد پترن اعتبار سنجی موبایل',
                    'order' => [
                        'paid' => 'کد پترن وضعیت سفارش(پرداخت شده)',
                        'sent' => 'کد پترن وضعیت سفارش(ارسال شده)',
                    ],
                ]
            ],
            'kavenegar' => [
                'title' => 'کاوه نگار',
            ]
        ]
    ],
    'messages' => [
        'inactive' => 'این قسمت غیر فعال است.',
        'code' => [
            'sent' => 'کد با موفقیت ارسال شد.',
            'unsent' => 'کد ارسال نشد.',
            'uncorrected' => 'کد وارد شده صحیح نمی باشد.',
            'different' => 'شماره موبایل متفاوت باید وارد کنید.',
            'has_verified' => 'شماره قبلا برای کاربر دیگر ثبت و تایید شده است.',
            'verified_1h' => 'بین هر تغییر شماره موبایل و تایید آن حداقل یک ساعت صبر کنید و شکیبا باشید.',
            'sent_1m' => 'بین هر ارسال حداقل یک دقیقه صبر کنید و شکیبا باشید.',
            'sent_3c_10m' => 'شما سه بار کد را فرستادید و تا ده دقیقه دیگر باید صبر کنید.',
            'expired' => 'متاسفانه زمان کد منقضی شده، لطفا مجدد کد را به همراه خود ارسال کنید.',
        ],
        'auth' => [
            'logged' => 'شما با موفقیت وارد شدید.',
            'registered' => 'ثبت نام شما با موفقیت انجام شد.',
            'notfound' => 'اطلاعات ورود شما صحیح نمی باشد.',
        ],
        'mobile' => [
            'not_entered' => 'شماره موبایل وارد نشده است.',
            'verified' => 'شماره موبایل شما تایید شد.',
        ]
    ],
    'patterns' => [
        'welcome' => "سلام به سایت ما خوش آمدید.\n با تشکر از ثبت نام شما",
        'verify' => "کد تایید شما:%code%",
        'order_paid' => "پرداخت شما به شماره فاکتور %order% با موفقیت پرداخت شد.",
        'order_sent' => "سفارش شما به شماره پیگیری %code% با موفقیت ارسال شد.\n آدرس پیگیری: %link%",
    ]
];
