<?php return [
    'plugin' => [
        'name' => 'تنظیمات سرویس پیامک',
        'description' => 'تنظیمات سرویس پیامک',
        'tab' => 'سرویس پیامک',
        'access_sms' => 'مدیریت سرویس پیامک',
    ],
    'components' => [
        'verify' => [
            'title' => 'تاببد شماره موبایل',
            'desc' => 'جهت استفاده از امکانات سایت باید شماره موبایل خود را تایید کنید.',
            'desc_code' => 'جهت تایید شماره موبایل خود کد ارسالی را وارد کنید.',
            'complete' => 'تایید شماره موبایل کامل شد ، اکنون می توانید از سیستم استفاده کنید.',
            'btn' => [
                'send' => 'تایید و ارسال پیامک',
                'check' => 'بررسی کد و تایید شماره موبایل',
            ],
        ],
    ],
    'sms' => [
        'title' => 'سرویس پیامک',
        'description' => 'تنظیمات سرویس پیامک',
        'mobile' => 'شماره موبایل:',
        'mobile_comment' => 'برای مثال: 09123456789',
        'code' => 'کد پیامک شده:',
        'code_comment' => 'کد تایید را وارد کنید',
        'status' => [
            'active' => 'فعال',
            'inactive' => 'غیر فعال',
        ]
    ],
    'options' => [
        'welcome' => 'خوش آمد گویی',
        'verify' => 'اعتبار سنجی موبایل',
        'order' => [
            'paid' => 'وضعیت سفارش(پرداخت شده)',
            'sent' => 'وضعیت سفارش(ارسال شده)',
        ],
    ],
    'gateway' => [
        'title' => 'درگاه پیامک',
        'description' => 'تنظیمات درگاه ارسال پیامک',
        'select' => 'انتخاب درگاه پیامک',
        'items' => [
            'global' => [
                'token' => 'کلید دسترسی (Api Key)',
                'from_number' => 'شماره ارسال',
                'from_number_pattern' => 'شماره ارسال برای پترن',
                'footer' => 'متن پاورقی پیامک',
            ],
            'cuphost' => [
                'title' => 'کاپ هاست',
                'patterns' => [
                    'welcome' => 'کد پترن خوش آمد گویی',
                    'verify' => 'کد پترن اعتبار سنجی موبایل',
                    'order' => [
                        'paid' => 'کد پترن وضعیت سفارش(پرداخت شده)',
                        'sent' => 'کد پترن وضعیت سفارش(ارسال شده)',
                    ],
                ]
            ],
            'kavenegar' => [
                'title' => 'کاوه نگار',
            ]
        ]
    ],
    'errors' => [
        'inactive' => 'این قسمت غیر فعال است.'
    ],
    'patterns' => [
        'welcome' => "سلام به سایت ما خوش آمدید.\n با تشکر از ثبت نام شما",
        'verify' => "کد تایید شما:%code%",
        'order_paid' => "پرداخت شما به شماره فاکتور %order% با موفقیت پرداخت شد.",
        'order_sent' => "سفارش شما به شماره پیگیری %code% با موفقیت ارسال شد.\n آدرس پیگیری: %link%",
    ]
];